InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаВыбораЗБ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ПакетДоговоров = &ПакетДоговоров
	               |	И ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
	               |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
	               |				ГДЕ
	               |					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент.ПакетДоговоров = &ПакетДоговоров)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЗалоговогоБилета";
	
	Запрос.УстановитьПараметр("ПакетДоговоров", Параметры.ПакетДоговоров);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ПоследняяОперация = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		
		Если ПоследняяОперация.Регистратор = ПоследняяОперация.ЗалоговыйБилет Тогда
			НоваяСтр = СписокЗБ.Добавить();
			НоваяСтр.НомерЗалоговогоБилета = Результат.НомерЗалоговогоБилета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	
	МассивЗБ = Новый Массив;
	
	Для каждого Стр Из СписокЗБ Цикл
		Если Стр.Выбран = Истина Тогда
				МассивЗБ.Добавить(Стр.НомерЗалоговогоБилета);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗБ.Количество() = 0 Тогда
		Предупреждение("Не выбран залоговый билет.");
	Иначе
		ЭтаФорма.Закрыть(МассивЗБ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуЗБ(Команда)
	Закрыть()
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБПоНомеру(Номер, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Номер, Дата,, Истина);
	
	Если Результат <> Неопределено Тогда
		ПоследняяОперация = Новый Структура;
		ПоследняяОперация.Вставить("ЗБ", Результат.ЗалоговыйБилет);
		ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	Иначе
		ПоследняяОперация = Неопределено;
	КонецЕсли;
	
	Возврат ПоследняяОперация;

КонецФункции
